import React from 'react';
import { Link } from 'react-router-dom';
import './index.less';

class PageApp extends React.Component{
    constructor(props){
        super(props);
    }
    render(){
        return(
            <div style={{padding: '20px'}}>
                <div style={{marginBottom: '20px'}}>
                   <Link to='/'> 点击去第一题 </Link>
                </div>
                {/* 参考我以前的代码,曾经做过滚动条样式修改 */}
                <div className="scrollBar">
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条

                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条

                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条

                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条

                    测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条测试滚动条
                </div>
            </div>
        )
    }
}
export default PageApp;

  